tests/artillery/test-api.yaml
config:
  target: http://localhost:12001/api/v2
  phases:
    #- duration: 60
    #  arrivalRate: 1
    #  rampTo: 5
    #  name: Warm up phase
    #- duration: 60
    #  arrivalRate: 5
    #  rampTo: 10
    #  name: Ramp up phase
    - duration: 30
      arrivalRate: 10
      rampTo: 30 # leads to fair
      name: Spike phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.reponse_time.p99: 100
      - http.reponse_time.p95: 75
scenarios:
  - name: Simple flow
    flow:
      - loop:
        - get:
            url: '/cluster'
        #- get:
        #    url: '/cluster/cluster-0'
        - get:
            url: '/cluster/cluster-0/partitions'
        count: 25